parapos/app/controllers/packjobs_controller.rb

  def index
    @packjobs = Packjob.paginate(page: params[:page], per_page: 5)
---
SELECT  "packjobs".* FROM "packjobs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "packjobs"

  def show
    @packjob = Packjob.find(params[:id])
---
SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @packjob = Packjob.find(params[:id])
---
SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @packjob = Packjob.new(packjob_params)

    if @packjob.save
---
INSERT INTO "packjobs" ("packer", "rig", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["packer", "Paul"], ["rig", "1"], ["created_at", "2018-02-10 02:59:17.330371"], ["updated_at", "2018-02-10 02:59:17.330371"]]

  def destroy
    @packjob = Packjob.find(params[:id])
    @packjob.destroy
---
SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "packjobs" WHERE "packjobs"."id" = ?  [["id", 1]]