parapos/app/controllers/rigs_controller.rb

SELECT  "rigs".* FROM "rigs" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @rigs = Rig.paginate(page: params[:page]).order('id DESC')